[
    {
        "valutazioneMedia": 5.0,
        "codLingua": "ita",
        "idLibro": 2,
        "link": "https://www.amazon.it/Lassommoir-Émile-Zola/dp/8811364671/ref=tmm_pap_swatch_0?_encoding=UTF8&qid=1682877089&sr=8-3",
        "autore": "Emile Zola",
        "genere": "Romanzo",
        "lingua": "Italiano",
        "editore": "Garzanti",
        "ean": "9788811364672",
        "titolo": "L'assommoir",
        "prezzo": 10.0,
        "pagine": 561,
        "descrizione": "L'ammazzatoio è l'osteria dove i personaggi vanno ad annegare nell'alcool la loro disperazione. Gervaise, amante da anni di Lantier, si stabilisce a Parigi con i due figli da lui avuti. Lantier la abbandona e Gervaise sposa Copeau, un operaio, che ha un grave incidente e per le cui cure vengono spesi tutti i risparmi. Demoralizzato Copeau si dà all'alcool e anche Gervaise comincia a bere e si degrada sempre più fino a prostituirsi. Morto il marito in un ospizio, Gervaise si riduce a vivere in un sottoscala in cui verrà infine trovata morta di stenti.",
        "volume": null,
        "annoEdizione": 2007
    },
    {
        "valutazioneMedia": 4.0,
        "codLingua": "ita",
        "idLibro": 1,
        "link": "https://www.ibs.it/furore-libro-john-steinbeck/e/9788845274053",
        "autore": "John Steinbeck",
        "genere": "Romanzo",
        "lingua": "Italiano",
        "editore": "Bompiani",
        "ean": "9788845274053",
        "titolo": "Furore",
        "prezzo": 15.0,
        "pagine": 633,
        "descrizione": "Pietra miliare della letteratura americana, Furore è un romanzo pubblicato negli Stati Uniti nel 1939 e coraggiosamente proposto in Italia da Valentino Bompiani l'anno seguente. Il libro fu perseguitato dalla censura fascista e solo ora, dopo più di 70 anni, vede la luce la prima edizione integrale, nella nuova traduzione di Sergio Claudio Perroni. Una versione basata sul testo inglese della Centennial Edition dell'opera di Steinbeck, che restituisce finalmente ai lettori la forza e la modernità della scrittura del Premio Nobel per la Letteratura 1962. Nell'odissea della famiglia Joad sfrattata dalla sua casa e dalla sua terra, in penosa marcia verso la California, lungo la Route 66 come migliaia e migliaia di americani, rivive la trasformazione di un'intera nazione. L'impatto amaro con la terra promessa dove la manodopera è sfruttata e mal pagata, dove ciascuno porta con sé la propria miseria \"come un marchio d'infamia\". Al tempo stesso romanzo di viaggio e ritratto epico della lotta dell'uomo contro l'ingiustizia, Furore è forse il più americano dei classici americani, da leggere oggi in tutta la sua bellezza.",
        "volume": null,
        "annoEdizione": 2013
    }
]