/* 
    QUESTO FILE È SOLO DI ESEMPIO
    CONTIENE COMMENTI -- NON UTILIZZARE
*/

/* http://localhost:8080/EsploraLibri/api/ricerca?valore_ricerca=Eric */
[
    {
        "codLingua": "ita",
        "prezzo": 12.0,
        "volume": null,
        "editore": "Neri Pozza",
        "lingua": "Italiano",
        "titolo": "Niente di nuovo sul fronte occidentale",
        "pagine": 208,
        "ean": "9788854511675",
        "link": "https://neripozza.it/libri/niente-di-nuovo-sul-fronte-occidentale",
        "descrizione": "Kantorek è il professore di Bäumer, Kropp, Müller e Leer, diciottenni tedeschi quando la voce dei cannoni della Grande Guerra tuona già da un capo all'altro dell'Europa. Ometto severo, vestito di grigio, con un muso da topo, dovrebbe essere una guida all'età virile, al mondo del lavoro, alla cultura e al progresso. Nelle ore di ginnastica, invece, fulmina i ragazzi con lo sguardo e tiene così tanti discorsi sulla patria in pericolo e sulla grandezza del servire lo Stato che l'intera classe, sotto la sua guida, si reca compatta al comando di presidio ad arruolarsi come volontari. Una volta al fronte, gli allievi di Kantorek - da Albert Kropp, il più intelligente della scuola a Paul Bäumer, il poeta che vorrebbe scrivere drammi - non tardano a capire di non essere affatto \"la gioventù di ferro\" chiamata a difendere la Germania in pericolo. La scoperta che il terrore della morte è più forte della grandezza del servire lo Stato li sorprende il giorno in cui, durante un assalto, Josef Behm - un ragazzotto grasso e tranquillo della scuola, arruolatosi per non rendersi ridicolo -, viene colpito agli occhi e, impazzito dal dolore, vaga tra le trincee prima di essere abbattuto a fucilate.",
        "annoEdizione": 2016,
        "genere": "Romanzo di guerra",
        "autore": "Erich Maria Remarque",
        "valutazioneMedia": -1.0,
        "pertinenza": 4.0,
        "idLibro": 4
    },
    {
        "codLingua": "ita",
        "prezzo": 14.0,
        "volume": null,
        "editore": "Laterza",
        "lingua": "Italiano",
        "titolo": "Il trionfo della borghesia",
        "pagine": 440,
        "ean": "9788842068877",
        "link": "https://www.laterza.it/scheda-libro/?isbn=9788842068877",
        "descrizione": "Tra il 1848 e il 1875 l'economia capitalistica estende la sua influenza su tutti i continenti, trasformando o semplicemente subordinando le realtà più diverse. L'ideologia liberista si afferma in Europa e negli Stati Uniti che insieme costituiscono il centro propulsore della grande trasformazione. Grandi concentrazioni di ricchezza, vasti movimenti di popolazioni, sviluppi straordinari e concrete applicazioni della tecnologia su larga scala caratterizzano questi decenni. Sul piano politico, la rivoluzione, che ha dominato la scena nei settanta anni precedenti, scompare dall'orizzonte.",
        "annoEdizione": 2004,
        "genere": "Storia contemporanea",
        "autore": "Eric Hobsbawm",
        "valutazioneMedia": -1.0,
        "pertinenza": 3.0,
        "idLibro": 14
    },
    {
        "codLingua": "ita",
        "prezzo": 15.0,
        "volume": null,
        "editore": "Bompiani",
        "lingua": "Italiano",
        "titolo": "Furore",
        "pagine": 633,
        "ean": "9788845274053",
        "link": "https://www.ibs.it/furore-libro-john-steinbeck/e/9788845274053",
        "descrizione": "Pietra miliare della letteratura americana, Furore è un romanzo pubblicato negli Stati Uniti nel 1939 e coraggiosamente proposto in Italia da Valentino Bompiani l'anno seguente. Il libro fu perseguitato dalla censura fascista e solo ora, dopo più di 70 anni, vede la luce la prima edizione integrale, nella nuova traduzione di Sergio Claudio Perroni. Una versione basata sul testo inglese della Centennial Edition dell'opera di Steinbeck, che restituisce finalmente ai lettori la forza e la modernità della scrittura del Premio Nobel per la Letteratura 1962. Nell'odissea della famiglia Joad sfrattata dalla sua casa e dalla sua terra, in penosa marcia verso la California, lungo la Route 66 come migliaia e migliaia di americani, rivive la trasformazione di un'intera nazione. L'impatto amaro con la terra promessa dove la manodopera è sfruttata e mal pagata, dove ciascuno porta con sé la propria miseria \"come un marchio d'infamia\". Al tempo stesso romanzo di viaggio e ritratto epico della lotta dell'uomo contro l'ingiustizia, Furore è forse il più americano dei classici americani, da leggere oggi in tutta la sua bellezza.",
        "annoEdizione": 2013,
        "genere": "Romanzo",
        "autore": "John Steinbeck",
        "valutazioneMedia": 4.0,
        "pertinenza": 1.0,
        "idLibro": 1
    },
    {
        "codLingua": "ita",
        "prezzo": 15.0,
        "volume": null,
        "editore": "laFeltrinelli",
        "lingua": "Italiano",
        "titolo": "Il conte di Montecristo",
        "pagine": 1200,
        "ean": "9788807901157",
        "link": "https://www.feltrinellieditore.it/opera/opera/il-conte-di-montecristo-1/",
        "descrizione": "Da capolavoro del romanzo popolare a capolavoro del romanzo: la storia della fortuna del Conte di Montecristo si potrebbe condensare nella lenta caduta di un aggettivo. Fin dal suo primo apparire, in quella Francia degli anni quaranta dell'Ottocento che era il più fervido e convulso laboratorio delle rivoluzioni europee, la storia dell'eroe borghese Edmond Dantès, eponimo della sfortuna e dell'ingiustizia, che si trasforma in spietato giustiziere, fu accolta dalle migliaia di avidi lettori di feuilleton come la più iperbolica incarnazione dello spirito del tempo. Un successo fulmineo, sancito dall'immediato passaggio all'edizione in volume e da un incredibile numero di ristampe e traduzioni. Ma fin da subito quell'aggettivo, “popolare”, suonò, in tutta una parte della critica colta, come una netta discriminazione, se non come una condanna. Al contrario, il Montecristo deve oggi essere situato nel posto che merita: all'apice della più felice stagione del romanzo europeo. Condotta sul testo francese meticolosamente stabilito da Claude Schopp, questa edizione comprende, oltre alla Prefazione di Schopp, un apparato di note al testo, nonché un Dizionario dei personaggi e delle persone storiche e un Indice dei luoghi che faranno la felicità di ogni patito di Dumas. Un romanzo travolgente e popolare nel senso migliore. Una grande, immortale storia di vendetta e misericordia.",
        "annoEdizione": 2014,
        "genere": "Romanzo",
        "autore": "Alexandre Dumas",
        "valutazioneMedia": -1.0,
        "pertinenza": 1.0,
        "idLibro": 10
    },
    {
        "codLingua": "ita",
        "prezzo": 12.0,
        "volume": null,
        "editore": "Bollati Boringhieri",
        "lingua": "Italiano",
        "titolo": "Mussolini ha fatto anche cose buone",
        "pagine": 160,
        "ean": "9788849836370",
        "link": "https://www.bollatiboringhieri.it/libri/francesco-filippi-mussolini-ha-fatto-anche-cose-buone-9788833932743",
        "descrizione": "Dopo oltre settant'anni dalla caduta del fascismo, mai come ora l'idra risolleva la testa, soprattutto su Internet, ma non solo. Frasi ripetute a mo' di barzelletta per anni, che parevano innocue e risibili fino a non molto tempo fa, si stanno sempre più facendo largo in Italia con tutt'altro obiettivo. E fanno presa. La storiografia ha indagato il fascismo e la figura di Mussolini in tutti i suoi dettagli e continua a farlo. Il quadro che è stato tracciato dalla grande maggioranza degli studiosi è quello di un regime dispotico, violento, miope e perlopiù incapace. L'accordo tra gli studiosi, che conoscono bene la storia, è piuttosto solido e i dati non mancano. Ma chi la storia non la conosce bene – e magari ha un'agenda politica precisa in mente – ha buon gioco a riprendere quelle antiche storielle e spacciarle per verità. È il meccanismo delle fake news, di cui tanto si parla in relazione a Internet; ma è anche il metodo propagandistico che fu tanto caro proprio ai fascisti di allora: \"Dite il falso, ditelo molte volte e diventerà una verità comune\". Per reagire a questo nuovo attacco non resta che la forza dello studio. Non resta che rispondere punto su punto, per mostrare la realtà storica che si cela dietro alle \"sparate\" della Rete. Perché una cosa è certa: Mussolini fu un pessimo amministratore, un modestissimo stratega, tutt'altro che un uomo di specchiata onestà, un economista inetto e uno spietato dittatore. Il risultato del suo regime ventennale fu un generale impoverimento della popolazione italiana, un aumento vertiginoso delle ingiustizie, la provincializzazione del paese e infine, come si sa, una guerra disastrosa. Basta un'ora per leggere questo volume, e sarà un'ora ben spesa, che darà a chiunque gli strumenti per difendersi dal rigurgito nostalgico che sta montando dentro e fuori il chiacchiericcio sguaiato dei social.",
        "annoEdizione": 2019,
        "genere": "Storia politica",
        "autore": "Francesco Filippi",
        "valutazioneMedia": -1.0,
        "pertinenza": 1.0,
        "idLibro": 16
    },
    {
        "codLingua": "ita",
        "prezzo": 12.0,
        "volume": null,
        "editore": "Mondadori",
        "lingua": "Italiano",
        "titolo": "Overlord",
        "pagine": 414,
        "ean": "9788804463740",
        "link": "https://www.mondadoristore.it/Overlord-D-day-battaglia-Max-Hastings/eai978880446374",
        "descrizione": "Il leggendario sbarco in Normandia, quel 6 giugno 1944 che nell'immaginario collettivo è rimasto come il D-Day, aveva nome in codice \"Overlord\". Lacerando il sipario della retorica e degli interessi di parte, Hastings ne ricostruisce la storia completa, dai preparativi alla faticosa battaglia, incerta fino all'ultimo, per la conquista dell'entroterra, rendendo giustizia all'esercito tedesco, schiacciato tra i contrordini di Hitler e la superiorità numerica degli alleati, ma ancora determinato a combattere per contendere ogni centimetro all'avanzata alleata. E rendendo inoltre giustizia ai reparti inglesi e americani, che emergono come i veri vincitori dell'operazione Overlord, e cioè come coloro che seppero spesso rimediare col proprio spirito d'iniziativa ai risvolti non sempre edificanti delle decisioni degli stati maggiori. In quest'opera, una sapiente miscela di appassionato interesse e di lucida obiettività, l'esperto di storia militare troverà una documentazione ineccepibile e il grande pubblico rivivrà quei giorni come in un romanzo, dove gli eventi che decisero le sorti del mondo si intrecciano ai piccoli episodi che ne compongono il mosaico.",
        "annoEdizione": 1999,
        "genere": "Romanzo storico",
        "autore": "Max Hastings",
        "valutazioneMedia": -1.0,
        "pertinenza": 1.0,
        "idLibro": 18
    }
]

/* http://localhost:8080/EsploraLibri/api/ricerca?pagine_min=600 */
[
    {
        "ean": "9788845274053",
        "descrizione": "Pietra miliare della letteratura americana, Furore è un romanzo pubblicato negli Stati Uniti nel 1939 e coraggiosamente proposto in Italia da Valentino Bompiani l'anno seguente. Il libro fu perseguitato dalla censura fascista e solo ora, dopo più di 70 anni, vede la luce la prima edizione integrale, nella nuova traduzione di Sergio Claudio Perroni. Una versione basata sul testo inglese della Centennial Edition dell'opera di Steinbeck, che restituisce finalmente ai lettori la forza e la modernità della scrittura del Premio Nobel per la Letteratura 1962. Nell'odissea della famiglia Joad sfrattata dalla sua casa e dalla sua terra, in penosa marcia verso la California, lungo la Route 66 come migliaia e migliaia di americani, rivive la trasformazione di un'intera nazione. L'impatto amaro con la terra promessa dove la manodopera è sfruttata e mal pagata, dove ciascuno porta con sé la propria miseria \"come un marchio d'infamia\". Al tempo stesso romanzo di viaggio e ritratto epico della lotta dell'uomo contro l'ingiustizia, Furore è forse il più americano dei classici americani, da leggere oggi in tutta la sua bellezza.",
        "titolo": "Furore",
        "autore": "John Steinbeck",
        "editore": "Bompiani",
        "link": "https://www.ibs.it/furore-libro-john-steinbeck/e/9788845274053",
        "annoEdizione": 2013,
        "lingua": "Italiano",
        "prezzo": 15.0,
        "volume": null,
        "pagine": 633,
        "genere": "Romanzo",
        "codLingua": "ita",
        "pertinenza": 0.0,
        "idLibro": 1,
        "valutazioneMedia": 4.0
    },
    {
        "ean": "9788822736765",
        "descrizione": "\"La fattoria degli animali\" (1945) è una favola in cui gli animali soppiantano gli umani espropriando la fattoria in cui lavorano sotto continui maltrattamenti. Dopo aver cacciato gli uomini la gestiscono autonomamente, fino a quando lo spirito rivoluzionario non sarà tradito e verranno a imporsi altre forme di sfruttamento: un'allegoria delle rivoluzioni trasformatesi in autoritarismi, o anche un esempio di letteratura per l'infanzia in cui si legge in controluce la lotta eterna tra giustizia e ingiustizia. \"1984\" (pubblicato nel 1949) è l'ultima opera di Orwell e il suo classico per eccellenza. Romanzo distopico, vede la storia di una società futuristica e disumanizzata, rigidamente divisa in classi e dominata da un'ideologia perversa che sovverte i valori basilari della civilizzazione, come anche i cardini della comunicazione, primo tra tutti il linguaggio. È, paradossalmente, sia una visione apocalittica dell'evoluzione del socialismo agli occhi di un autore anarchico, sia una feroce critica di tutti i capitalismi, colpevoli di proporre propagandisticamente visioni distorte della realtà. \"Senza un soldo a Parigi e a Londra\" (1933), l'opera prima di George Orwell, è un prezioso scritto che contamina autobiografia, invenzione e reportage, una perla della letteratura della working-class. Ma il primo, vero romanzo è \"Giorni in Birmania\" (1934), in cui Orwell demistifica l'imperialismo inglese, denunciandone il razzismo e svelando la falsa coscienza degli europei. \"Omaggio alla Catalogna\" (1938) è un resoconto personale della Guerra Civile Spagnola, a cui Orwell partecipò; la sua è una testimonianza diretta e al contempo un'opera di grande interesse storico. È anche il racconto di un'utopia, di quel sogno interrotto che condusse l'autore alla stagione delle distopie che lo avrebbe reso immortale.",
        "titolo": "I capolavori",
        "autore": "George Orwell",
        "editore": "Newton Compton Editori",
        "link": "https://www.ibs.it/capolavori-fattoria-degli-animali-1984-libro-george-orwell/e/9788822736765",
        "annoEdizione": 2021,
        "lingua": "Italiano",
        "prezzo": 12.9,
        "volume": null,
        "pagine": 960,
        "genere": "Romanzo classico",
        "codLingua": "ita",
        "pertinenza": 0.0,
        "idLibro": 5,
        "valutazioneMedia": -1.0
    },
    {
        "ean": "9788807901157",
        "descrizione": "Da capolavoro del romanzo popolare a capolavoro del romanzo: la storia della fortuna del Conte di Montecristo si potrebbe condensare nella lenta caduta di un aggettivo. Fin dal suo primo apparire, in quella Francia degli anni quaranta dell'Ottocento che era il più fervido e convulso laboratorio delle rivoluzioni europee, la storia dell'eroe borghese Edmond Dantès, eponimo della sfortuna e dell'ingiustizia, che si trasforma in spietato giustiziere, fu accolta dalle migliaia di avidi lettori di feuilleton come la più iperbolica incarnazione dello spirito del tempo. Un successo fulmineo, sancito dall'immediato passaggio all'edizione in volume e da un incredibile numero di ristampe e traduzioni. Ma fin da subito quell'aggettivo, “popolare”, suonò, in tutta una parte della critica colta, come una netta discriminazione, se non come una condanna. Al contrario, il Montecristo deve oggi essere situato nel posto che merita: all'apice della più felice stagione del romanzo europeo. Condotta sul testo francese meticolosamente stabilito da Claude Schopp, questa edizione comprende, oltre alla Prefazione di Schopp, un apparato di note al testo, nonché un Dizionario dei personaggi e delle persone storiche e un Indice dei luoghi che faranno la felicità di ogni patito di Dumas. Un romanzo travolgente e popolare nel senso migliore. Una grande, immortale storia di vendetta e misericordia.",
        "titolo": "Il conte di Montecristo",
        "autore": "Alexandre Dumas",
        "editore": "laFeltrinelli",
        "link": "https://www.feltrinellieditore.it/opera/opera/il-conte-di-montecristo-1/",
        "annoEdizione": 2014,
        "lingua": "Italiano",
        "prezzo": 15.0,
        "volume": null,
        "pagine": 1200,
        "genere": "Romanzo",
        "codLingua": "ita",
        "pertinenza": 0.0,
        "idLibro": 10,
        "valutazioneMedia": -1.0
    },
    {
        "ean": "9788883375873",
        "descrizione": "Scritto da Lev Tolstoj tra il 1863 e il 1869, Guerra e pace è considerato il più grande romanzo russo. In questa celeberrima opera si fondono due narrazioni: da una parte, i grandi avvenimenti storici che travolsero la Russia all'inizio del XIX secolo; dall'altra, le vicende delle due famiglie dei Bolkonskij e dei Rostov, unite dalla figura del conte. In tutto il romanzo emerge chiaro il pensiero di Tolstoj, per il quale non sono gli eroi, i generali e i re a fare la storia, ma le grandi masse, con le loro paure, le loro sofferenze e le loro speranze. La storia è infatti una successione inarrestabile di eventi che il singolo non può modificare. L'autore è abilissimo nel descrivere l'identità psicologica dei personaggi: dal principe Andrej, altero e deluso dalla vita, alla bella Nataša, vivace e affascinante, al conte Pierre, fragile e tormentato, ma le loro vicende non avrebbero senso senza il racconto della storia del popolo russo, di cui essi divengono dei simboli. In Guerra e pace sembra che i veri protagonisti siano proprio lo scorrere del tempo e l'avvicendarsi ineluttabile degli eventi, che rendono questo capolavoro della letteratura quasi un poema epico.",
        "titolo": "Guerra e pace",
        "autore": "Lev Tolstoj",
        "editore": "Crescere",
        "link": "https://www.edizionicrescere.it/libro-isbn-9788883375873.aspx",
        "annoEdizione": 2017,
        "lingua": "Italiano",
        "prezzo": 9.9,
        "volume": null,
        "pagine": 1216,
        "genere": "Romanzo storico",
        "codLingua": "ita",
        "pertinenza": 0.0,
        "idLibro": 11,
        "valutazioneMedia": -1.0
    }
]

/* http://localhost:8080/EsploraLibri/api/ricerca?valore_ricerca=9788845274053 */
[
    {
        "ean": "9788845274053",
        "descrizione": "Pietra miliare della letteratura americana, Furore è un romanzo pubblicato negli Stati Uniti nel 1939 e coraggiosamente proposto in Italia da Valentino Bompiani l'anno seguente. Il libro fu perseguitato dalla censura fascista e solo ora, dopo più di 70 anni, vede la luce la prima edizione integrale, nella nuova traduzione di Sergio Claudio Perroni. Una versione basata sul testo inglese della Centennial Edition dell'opera di Steinbeck, che restituisce finalmente ai lettori la forza e la modernità della scrittura del Premio Nobel per la Letteratura 1962. Nell'odissea della famiglia Joad sfrattata dalla sua casa e dalla sua terra, in penosa marcia verso la California, lungo la Route 66 come migliaia e migliaia di americani, rivive la trasformazione di un'intera nazione. L'impatto amaro con la terra promessa dove la manodopera è sfruttata e mal pagata, dove ciascuno porta con sé la propria miseria \"come un marchio d'infamia\". Al tempo stesso romanzo di viaggio e ritratto epico della lotta dell'uomo contro l'ingiustizia, Furore è forse il più americano dei classici americani, da leggere oggi in tutta la sua bellezza.",
        "titolo": "Furore",
        "autore": "John Steinbeck",
        "editore": "Bompiani",
        "link": "https://www.ibs.it/furore-libro-john-steinbeck/e/9788845274053",
        "annoEdizione": 2013,
        "lingua": "Italiano",
        "prezzo": 15.0,
        "volume": null,
        "pagine": 633,
        "genere": "Romanzo",
        "codLingua": "ita",
        "pertinenza": 20.0,
        "idLibro": 1,
        "valutazioneMedia": 4.0
    }
]